Revit 2026 API

# BoundingBoxXYZTransform Property

---

The transform from the coordinate space of the box to the model coordinate space.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform Transform { get; set; }
```
```vb
Public Property Transform As Transform
	Get
	Set
```
```cpp
public:
property Transform^ Transform {
	Transform^ get ();
	void set (Transform^ value);
}
```
```fsharp
member Transform : Transform with get, set
```

#### Property Value

Transform

The transform must always be right-handed and orthonormal.

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace